Q1. List any five functions of the pandas library with execution.

1.dtypes,2type(pd.dtypes),3.pd.DataFrame,4.read(),5.read_tail()

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [2]:
import pandas as pd
data={"column_A":["rahul","mina","anuj"],
      "column_B":["rohini","mohan","ritik"],
      "column_C":["player","singer","bussness_man"]}

In [3]:
data

{'column_A': ['rahul', 'mina', 'anuj'],
 'column_B': ['rohini', 'mohan', 'ritik'],
 'column_C': ['player', 'singer', 'bussness_man']}

In [4]:
df=pd.DataFrame(data)

In [5]:
df.dtypes

column_A    object
column_B    object
column_C    object
dtype: object

In [6]:
type(df.dtypes)

pandas.core.series.Series

In [7]:
df['new_column']=1,3,5

In [8]:
df.head()

  column_A column_B      column_C  new_column
0    rahul   rohini        player           1
1     mina    mohan        singer           3
2     anuj    ritik  bussness_man           5

In [9]:
df.set_index('new_column')  #new_column taken as re-index column

           column_A column_B      column_C
new_column
1             rahul   rohini        player
3              mina    mohan        singer
5              anuj    ritik  bussness_man

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [10]:
result={"maths":["max","rey","monty"],
        "value":[85,87,90]}

In [11]:
result

{'maths': ['max', 'rey', 'monty'], 'value': [85, 87, 90]}

In [12]:
tm=pd.DataFrame(result)

In [13]:
tm['total_marks']=0

In [14]:
tm.head()

   maths  value  total_marks
0    max     85            0
1    rey     87            0
2  monty     90            0

In [15]:
tm['total_marks']=tm['value']

In [16]:
tm.head()

   maths  value  total_marks
0    max     85           85
1    rey     87           87
2  monty     90           90

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [17]:
new={"text":["this is the words that count by the word count variable"]}

In [19]:
n1=pd.DataFrame(new)

In [20]:
n1['word_count']=0

In [21]:
n1.head()

                                                text  word_count
0  this is the words that count by the word count...           0

In [22]:
n1.head()

                                                text  word_count
0  this is the words that count by the word count...           0

Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size() shows the int value of the text and their number of use in the data set.
other hand DataFrame.shape() shows the number of column and row are use in the data set.

Q6. Which function of pandas do we use to read an excel file?

.xlsx extention we use to read the excel data and their pd.read_excel("file_name")

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [52]:
data=("empir@gmail.com")

In [53]:
data

'empir@gmail.com'

In [55]:
df1=data[0:5]

In [58]:
df1

'empir'

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [26]:
num={"A":[5,4,8,2,7,8],
     "B":[8,5,9,6,7,1],
     "C":[5,8,7,8,9,2]}

In [27]:
num

{'A': [5, 4, 8, 2, 7, 8], 'B': [8, 5, 9, 6, 7, 1], 'C': [5, 8, 7, 8, 9, 2]}

In [28]:
n1=pd.DataFrame(num)

In [29]:
n1.dtypes

A    int64
B    int64
C    int64
dtype: object

In [30]:
n1.columns

Index(['A', 'B', 'C'], dtype='object')

In [31]:
N2=n1[['A','B','C']]>5

In [32]:
N2   #ONLY CONTAIN GREATER THAN 5 WHICH TRUE, FALSE MEANS WHICH IS NOT GREATER THAN 5

       A      B      C
0  False   True  False
1  False  False   True
2   True   True   True
3  False   True   True
4   True   True   True
5   True  False  False